# Merge


#merge,join,concatinate
#to merge it will check column first it will merge on basis of common column 
#first col is left col
#by defalt inner join

In [12]:
import pandas as pd
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7),'d2': range(7)})

In [28]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3),'d2':range(3)})

In [10]:
df1

  key  data1  d2
0   b      0   0
1   b      1   1
2   a      2   2
3   c      3   3
4   a      4   4
5   a      5   5
6   b      6   6

In [6]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [13]:
#merge can be done on bases of index,common column
pd.merge(df1,df2)

  key  data1  d2  data2
0   b      0   0      1
1   b      1   1      1
2   b      6   6      1
3   a      2   2      0
4   a      4   4      0
5   a      5   5      0

In [14]:
#merge is not concatination |names will appear 2 times if present in both tables
#if no common columns it will give merge error now to merge we have to tell the col name to merge
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})

In [15]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],'data2': range(3)})

In [16]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [18]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey',how ='outer')

  lkey  data1 rkey  data2
0    b    0.0    b    1.0
1    b    1.0    b    1.0
2    b    6.0    b    1.0
3    a    2.0    a    0.0
4    a    4.0    a    0.0
5    a    5.0    a    0.0
6    c    3.0  NaN    NaN
7  NaN    NaN    d    2.0

# Join

In [19]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],index=['a', 'c', 'e'],columns=['Ohio', 'Nevada'])

In [20]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],index=['b', 'c', 'd', 'e'],columns=['Missouri', 'Alabama'])

In [21]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [22]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [23]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [24]:
right2.join(left2)

   Missouri  Alabama  Ohio  Nevada
b       7.0      8.0   NaN     NaN
c       9.0     10.0   3.0     4.0
d      11.0     12.0   NaN     NaN
e      13.0     14.0   5.0     6.0

In [25]:
left2.join(right2,how = 'outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [26]:
#shft+tab= all info about a function

In [29]:
pd.merge(df1,df2,on = 'key',suffixes=('_left','_right'))

  key  data1  d2_left  data2  d2_right
0   b      0        0      1         1
1   b      1        1      1         1
2   b      6        6      1         1
3   a      2        2      0         0
4   a      4        4      0         0
5   a      5        5      0         0

# concatinate

In [33]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
s2
s3 = pd.Series([5, 6], index=['f', 'g'])
s3

f    5
g    6
dtype: int64

In [32]:
pd.concat([s2,s3])

c    2
d    3
e    4
f    5
g    6
dtype: int64

In [35]:
import numpy as np
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],columns=['one', 'two'])

In [36]:
import tensorflow as tf

In [38]:
df2=pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],columns=['one', 'two'])

In [39]:
pd.concat([df1,df2])

   one  two
a    0    1
b    2    3
c    4    5
a    5    6
c    7    8